NextFOAM-24/tutorials/heatTransfer/chtMultiRegionFoam/windshieldCondensation/0.orig/cabin/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    // Heater on at 60s
    inlet
    {
        type            uniformNormalFixedValue;
        uniformValue    constant -2;
        ramp
        {
            type        step;
            start       60;
            duration    1000;
        }
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    symmetry
    {
        type            symmetryPlane;
    }

    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    cabin_to_windshield
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
